#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra-data relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/dphoto/dphoto/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/dphoto/dphoto

To view this run in a browser, visit:
https://app.terraform.io/app/dphoto/dphoto-live/runs/run-3HyaPf7E9tY6TX6M

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
data.aws_iam_policy_document.index_rw: Reading...
aws_s3_bucket_public_access_block.s3_block_public_access: Refreshing state... [id=dphoto-live-storage]
aws_ssm_parameter.catalog_table_name: Refreshing state... [id=/dphoto/live/catalog/tableName]
aws_s3_bucket.storage: Refreshing state... [id=dphoto-live-storage]
aws_iam_user.cli: Refreshing state... [id=dphoto-live-cli]
aws_kms_key.storage[0]: Refreshing state... [id=64ce2c68-36b4-49cf-8f4e-4e78ec71a41c]
data.aws_iam_policy_document.index_rw: Read complete after 0s [id=1595237765]
aws_iam_policy.index_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-index-rw]
aws_iam_access_key.cli: Refreshing state... [id=AKIAW32ATO5LD7TVC6NI]
aws_iam_user_policy_attachment.cli_table: Refreshing state... [id=dphoto-live-cli-20210527210154843500000002]
aws_ssm_parameter.iam_policy_dyn_table_rw: Refreshing state... [id=/dphoto/live/iam/policies/indexRWArn]
aws_ssm_parameter.storage_bucket_name: Refreshing state... [id=/dphoto/live/storage/bucketName]
data.aws_iam_policy_document.storage_ro: Reading...
data.aws_iam_policy_document.storage_rw: Reading...
data.aws_iam_policy_document.storage_ro: Read complete after 0s [id=2651647098]
data.aws_iam_policy_document.storage_rw: Read complete after 0s [id=2008889015]
aws_iam_policy.storage_ro: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-storage-ro]
aws_iam_policy.storage_rw: Refreshing state... [id=arn:aws:iam::472045025110:policy/dphoto/dphoto-live-storage-rw]
aws_iam_user_policy_attachment.cli_bucket: Refreshing state... [id=dphoto-live-cli-20210527210154836100000001]
aws_ssm_parameter.iam_policy_bucket_ro: Refreshing state... [id=/dphoto/live/iam/policies/storageROArn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.archive_sns_publish will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "archive_sns_publish" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.archive_sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "archive_sqs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "Allow SNS to publish messages"

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.archive_sqs_send will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "archive_sqs_send" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.cache_rw will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cache_rw" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:*Object",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.archive_sns_publish will be created
  + resource "aws_iam_policy" "archive_sns_publish" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "dphoto-live-archive-sns-publish"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all  = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
    }

  # aws_iam_policy.archive_sqs_send will be created
  + resource "aws_iam_policy" "archive_sqs_send" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "dphoto-live-archive-sqs-send"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all  = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
    }

  # aws_iam_policy.cache_rw will be created
  + resource "aws_iam_policy" "cache_rw" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "dphoto-live-cache-rw"
      + path      = "/dphoto/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_user_policy_attachment.archive_sns_publish will be created
  + resource "aws_iam_user_policy_attachment" "archive_sns_publish" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "dphoto-live-cli"
    }

  # aws_iam_user_policy_attachment.archive_sqs_send will be created
  + resource "aws_iam_user_policy_attachment" "archive_sqs_send" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "dphoto-live-cli"
    }

  # aws_iam_user_policy_attachment.cli_cache will be created
  + resource "aws_iam_user_policy_attachment" "cli_cache" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "dphoto-live-cli"
    }

  # aws_s3_bucket.cache will be created
  + resource "aws_s3_bucket" "cache" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dphoto-live-cache"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all                    = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_acl.cache will be created
  + resource "aws_s3_bucket_acl" "cache" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_acl.storage will be created
  + resource "aws_s3_bucket_acl" "storage" {
      + acl    = "private"
      + bucket = "dphoto-live-storage"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.cache_expiration will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "cache_expiration" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "1-month-eviction"
          + status = "Enabled"

          + expiration {
              + days                         = 120
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + prefix = "w="
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.storage will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "storage" {
      + bucket = "dphoto-live-storage"
      + id     = (known after apply)

      + rule {
          + id     = "non-current-eviction"
          + status = "Enabled"

          + noncurrent_version_expiration {
              + noncurrent_days = 30
            }

          + noncurrent_version_transition {
              + noncurrent_days = 0
              + storage_class   = "GLACIER"
            }
        }
      + rule {
          + id     = "current-transition"
          + status = "Disabled"

          + transition {
              + days          = 7
              + storage_class = "GLACIER_IR"
            }
        }
    }

  # aws_s3_bucket_ownership_controls.cache will be created
  + resource "aws_s3_bucket_ownership_controls" "cache" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_ownership_controls.storage will be created
  + resource "aws_s3_bucket_ownership_controls" "storage" {
      + bucket = "dphoto-live-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_public_access_block.s3_block_public_access will be destroyed
  # (because aws_s3_bucket_public_access_block.s3_block_public_access is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "s3_block_public_access" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "dphoto-live-storage" -> null
      - id                      = "dphoto-live-storage" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.s3_cache_block_public_access will be created
  + resource "aws_s3_bucket_public_access_block" "s3_cache_block_public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.s3_storage_block_public_access will be created
  + resource "aws_s3_bucket_public_access_block" "s3_storage_block_public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "dphoto-live-storage"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.storage["arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "storage" {
      + bucket = "dphoto-live-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "arn:aws:kms:eu-west-1:472045025110:key/64ce2c68-36b4-49cf-8f4e-4e78ec71a41c"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.cache will be created
  + resource "aws_s3_bucket_versioning" "cache" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

  # aws_s3_bucket_versioning.storage will be created
  + resource "aws_s3_bucket_versioning" "storage" {
      + bucket = "dphoto-live-storage"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_sns_topic.archive will be created
  + resource "aws_sns_topic" "archive" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "dphoto-live-archive-jobs"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all                    = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
    }

  # aws_sqs_queue.async_archive_caching_jobs will be created
  + resource "aws_sqs_queue" "async_archive_caching_jobs" {
      + arn                               = (known after apply)
      + content_based_deduplication       = true
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = true
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "dphoto-live-async-archive-caching-jobs.fifo"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all                          = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 900
    }

  # aws_sqs_queue_policy.async_archive_caching_jobs will be created
  + resource "aws_sqs_queue_policy" "async_archive_caching_jobs" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_ssm_parameter.cache_bucket_name will be created
  + resource "aws_ssm_parameter" "cache_bucket_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/s3/cache/bucketName"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.catalog_table_name must be replaced
-/+ resource "aws_ssm_parameter" "catalog_table_name" {
      ~ arn            = "arn:aws:ssm:eu-west-1:472045025110:parameter/dphoto/live/catalog/tableName" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "/dphoto/live/catalog/tableName" -> (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      ~ name           = "/dphoto/live/catalog/tableName" -> "/dphoto/live/dynamodb/catalog/tableName" # forces replacement
        tags           = {
            "Application" = "dphoto-data"
            "CreatedBy"   = "terraform"
            "Environment" = "live"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_ssm_parameter.iam_policy_archive_sns_publish will be created
  + resource "aws_ssm_parameter" "iam_policy_archive_sns_publish" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/iam/policies/archive_sns_publish/arn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.iam_policy_archive_sqs_send will be created
  + resource "aws_ssm_parameter" "iam_policy_archive_sqs_send" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/iam/policies/archive_sqs_send/arn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.iam_policy_cache_rw will be created
  + resource "aws_ssm_parameter" "iam_policy_cache_rw" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/iam/policies/cacheRWArn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sns_archive_arn will be created
  + resource "aws_ssm_parameter" "sns_archive_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/sns/archive/arn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_archive_arn will be created
  + resource "aws_ssm_parameter" "sqs_archive_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/sqs/archive/arn"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_archive_url will be created
  + resource "aws_ssm_parameter" "sqs_archive_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dphoto/live/sqs/archive/url"
      + tags           = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tags_all       = {
          + "Application" = "dphoto-data"
          + "CreatedBy"   = "terraform"
          + "Environment" = "live"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.storage_bucket_name must be replaced
-/+ resource "aws_ssm_parameter" "storage_bucket_name" {
      ~ arn            = "arn:aws:ssm:eu-west-1:472045025110:parameter/dphoto/live/storage/bucketName" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "/dphoto/live/storage/bucketName" -> (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      ~ name           = "/dphoto/live/storage/bucketName" -> "/dphoto/live/s3/storage/bucketName" # forces replacement
        tags           = {
            "Application" = "dphoto-data"
            "CreatedBy"   = "terraform"
            "Environment" = "live"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 1 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 30 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + archive_bucket_name        = "dphoto-live-storage"
  - bucket_name                = "dphoto-live-storage" -> null
  + cache_bucket_name          = "dphoto-live-cache"
  + sns_archive_arn            = (known after apply)
  + sqs_archive_url            = (known after apply)
  + sqs_async_archive_jobs_arn = (known after apply)

```

</details>

*Pusher: @thomasduchatelle, Action: `pull_request`*